Revit 2017 API
AssetPropertyFloat Class
Represents a property of float value.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetPropertyFloat : AssetProperty
Visual Basic
Public Class AssetPropertyFloat _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyFloat : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyFloat
See Also
AssetPropertyFloat Members
Autodesk.Revit.Utility Namespace